---
kind: other
id: Methods.T:Autodesk.Revit.UI.Plumbing.IPipeFittingAndAccessoryPressureDropUIServer
source: html/6f4962b3-11bb-45e4-95d7-1fdc9003f361.htm
---
# IPipeFittingAndAccessoryPressureDropUIServer Methods

Returns the Id of the corresponding DB server for which this server provides an optional UI.